hdiutil.org
#+TITLE: How to Manipulate Disk Images Under Mac

By default, file system under Mac is case insensitive. It may cause
trouble when you work with some projects like Linux Kernel. To solve
the problem, you can create a disk image with case sensitive file
system, and attach to a mount point to use.

Say we want to create disk image at =/usr/local=, and attach it to
=/usr/local/src=. All operations are executed under =/usr/local=.

* Create Disk Image

  #+BEGIN_SRC sh
    $ hdiutil create -size 10G src -type SPARSE -fs 'Case-sensitive Journaled HFS+' -volname src
  #+END_SRC

  Image =src.sparseimage= will be created, with case sensitive
  journaled file system and the size limit 20G.
  
* Attach Disk Image

  #+BEGIN_SRC sh
    $ mkdir src
    $ hdiutil attach -mountpoint src src.sparseimage #=>
    /dev/disk4              GUID_partition_scheme
    /dev/disk4s1            EFI
    /dev/disk4s2            Apple_HFS                       /usr/local/src
  #+END_SRC

* Detach Disk Image

  #+BEGIN_SRC sh
    $ hdiutil detach src #=>
    "disk4" unmounted.
    "disk4" ejected.
  #+END_SRC

* Resize Disk Image If needed

  If =20G= is not enough you can resize the image:
  
  #+BEGIN_SRC sh
    $ hdiutil resize -size 20G src.sparseimage
  #+END_SRC

