hdiutil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-12-22 Fri 13:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Manipulate Disk Images Under Mac</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">How to Manipulate Disk Images Under Mac</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc11a74b">Create Disk Image</a></li>
<li><a href="#orgb7c87d9">Attach Disk Image</a></li>
<li><a href="#org5f993fc">Detach Disk Image</a></li>
<li><a href="#orgbdfb446">Resize Disk Image If needed</a></li>
</ul>
</div>
</div>
<p>
By default, file system under Mac is case insensitive. It may cause
trouble when you work with some projects like Linux Kernel. To solve
the problem, you can create a disk image with case sensitive file
system, and attach to a mount point to use.
</p>

<p>
Say we want to create disk image at <code>/usr/local</code>, and attach it to
<code>/usr/local/src</code>. All operations are executed under <code>/usr/local</code>.
</p>

<div id="outline-container-orgc11a74b" class="outline-2">
<h2 id="orgc11a74b">Create Disk Image</h2>
<div class="outline-text-2" id="text-orgc11a74b">
<div class="org-src-container">
<pre class="src src-sh">$ hdiutil create -size 10G src -type SPARSE -fs <span class="org-string">'Case-sensitive Journaled HFS+'</span> -volname src
</pre>
</div>

<p>
Image <code>src.sparseimage</code> will be created, with case sensitive
journaled file system and the size limit 20G.
</p>
</div>
</div>

<div id="outline-container-orgb7c87d9" class="outline-2">
<h2 id="orgb7c87d9">Attach Disk Image</h2>
<div class="outline-text-2" id="text-orgb7c87d9">
<div class="org-src-container">
<pre class="src src-sh">$ mkdir src
$ hdiutil attach -mountpoint src src.sparseimage <span class="org-comment-delimiter">#</span><span class="org-comment">=&gt;</span>
/dev/disk4              GUID_partition_scheme
/dev/disk4s1            EFI
/dev/disk4s2            Apple_HFS                       /usr/local/src
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f993fc" class="outline-2">
<h2 id="org5f993fc">Detach Disk Image</h2>
<div class="outline-text-2" id="text-org5f993fc">
<div class="org-src-container">
<pre class="src src-sh">$ hdiutil detach src <span class="org-comment-delimiter">#</span><span class="org-comment">=&gt;</span>
<span class="org-string">"disk4"</span> unmounted.
<span class="org-string">"disk4"</span> ejected.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbdfb446" class="outline-2">
<h2 id="orgbdfb446">Resize Disk Image If needed</h2>
<div class="outline-text-2" id="text-orgbdfb446">
<p>
If <code>20G</code> is not enough you can resize the image:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ hdiutil resize -size 20G src.sparseimage
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
